MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F451JEUB/mcu.h
    /* SWDT */
    INT_SRC_SWDT_REFUDF         = 87U,      /* SWDT_REFUDF */

    /* TIMER 6 */
    INT_SRC_TMR6_1_GCMP_A       = 96U,      /* TMR61_GCMA */
    INT_SRC_TMR6_1_GCMP_B       = 97U,      /* TMR61_GCMB */
    INT_SRC_TMR6_1_GCMP_C       = 98U,      /* TMR61_GCMC */
    INT_SRC_TMR6_1_GCMP_D       = 99U,      /* TMR61_GCMD */
    INT_SRC_TMR6_1_GCMP_E       = 100U,     /* TMR61_GCME */
    INT_SRC_TMR6_1_GCMP_F       = 101U,     /* TMR61_GCMF */
    INT_SRC_TMR6_1_OVF          = 102U,     /* TMR61_GOVF */
    INT_SRC_TMR6_1_UDF          = 103U,     /* TMR61_GUDF */
    INT_SRC_TMR6_1_DTE          = 104U,     /* TMR61_GDTE */
    INT_SRC_TMR6_1_SCMP_A       = 107U,     /* TMR61_SCMA */
    INT_SRC_TMR6_1_SCMP_B       = 108U,     /* TMR61_SCMB */
    INT_SRC_TMR6_2_GCMP_A       = 112U,     /* TMR62_GCMA */
    INT_SRC_TMR6_2_GCMP_B       = 113U,     /* TMR62_GCMB */
    INT_SRC_TMR6_2_GCMP_C       = 114U,     /* TMR62_GCMC */
    INT_SRC_TMR6_2_GCMP_D       = 115U,     /* TMR62_GCMD */
    INT_SRC_TMR6_2_GCMP_E       = 116U,     /* TMR62_GCME */
    INT_SRC_TMR6_2_GCMP_F       = 117U,     /* TMR62_GCMF */
    INT_SRC_TMR6_2_OVF          = 118U,     /* TMR62_GOVF */
    INT_SRC_TMR6_2_UDF          = 119U,     /* TMR62_GUDF */
    INT_SRC_TMR6_2_DTE          = 120U,     /* TMR62_GDTE */
    INT_SRC_TMR6_2_SCMP_A       = 123U,     /* TMR62_SCMA */
    INT_SRC_TMR6_2_SCMP_B       = 124U,     /* TMR62_SCMB */
    INT_SRC_TMR6_3_GCMP_A       = 128U,     /* TMR63_GCMA */
    INT_SRC_TMR6_3_GCMP_B       = 129U,     /* TMR63_GCMB */
    INT_SRC_TMR6_3_GCMP_C       = 130U,     /* TMR63_GCMC */
    INT_SRC_TMR6_3_GCMP_D       = 131U,     /* TMR63_GCMD */
    INT_SRC_TMR6_3_GCMP_E       = 132U,     /* TMR63_GCME */
    INT_SRC_TMR6_3_GCMP_F       = 133U,     /* TMR63_GCMF */
    INT_SRC_TMR6_3_OVF          = 134U,     /* TMR63_GOVF */
    INT_SRC_TMR6_3_UDF          = 135U,     /* TMR63_GUDF */
    INT_SRC_TMR6_3_DTE          = 136U,     /* TMR63_GDTE */
    INT_SRC_TMR6_3_SCMP_A       = 139U,     /* TMR63_SCMA */
    INT_SRC_TMR6_3_SCMP_B       = 140U,     /* TMR63_SCMB */

    /* TIMER A */
    INT_SRC_TMRA_1_OVF          = 256U,     /* TMRA1_OVF */
    INT_SRC_TMRA_1_UDF          = 257U,     /* TMRA1_UDF */
    INT_SRC_TMRA_1_CMP          = 258U,     /* TMRA1_CMP */
    INT_SRC_TMRA_2_OVF          = 259U,     /* TMRA2_OVF */
    INT_SRC_TMRA_2_UDF          = 260U,     /* TMRA2_UDF */
    INT_SRC_TMRA_2_CMP          = 261U,     /* TMRA2_CMP */
    INT_SRC_TMRA_3_OVF          = 262U,     /* TMRA3_OVF */
    INT_SRC_TMRA_3_UDF          = 263U,     /* TMRA3_UDF */
    INT_SRC_TMRA_3_CMP          = 264U,     /* TMRA3_CMP */
    INT_SRC_TMRA_4_OVF          = 265U,     /* TMRA4_OVF */
    INT_SRC_TMRA_4_UDF          = 266U,     /* TMRA4_UDF */
    INT_SRC_TMRA_4_CMP          = 267U,     /* TMRA4_CMP */
    INT_SRC_TMRA_5_OVF          = 268U,     /* TMRA5_OVF */
    INT_SRC_TMRA_5_UDF          = 269U,     /* TMRA5_UDF */
    INT_SRC_TMRA_5_CMP          = 270U,     /* TMRA5_CMP */
    INT_SRC_TMRA_6_OVF          = 272U,     /* TMRA6_OVF */
    INT_SRC_TMRA_6_UDF          = 273U,     /* TMRA6_UDF */
    INT_SRC_TMRA_6_CMP          = 274U,     /* TMRA6_CMP */

    /* USB FS */
    INT_SRC_USBFS_GLB           = 275U,     /* USBFS_GLB */

    /* USRAT */
    INT_SRC_USART1_EI           = 278U,     /* USART1_EI  */
    INT_SRC_USART1_RI           = 279U,     /* USART1_RI  */
    INT_SRC_USART1_TI           = 280U,     /* USART1_TI  */
    INT_SRC_USART1_TCI          = 281U,     /* USART1_TCI */
    INT_SRC_USART1_RTO          = 282U,     /* USART1_RTO */
    INT_SRC_USART1_WUPI         = 432U,     /* USART1_WUPI */
    INT_SRC_USART2_EI           = 283U,     /* USART2_EI  */
    INT_SRC_USART2_RI           = 284U,     /* USART2_RI  */
    INT_SRC_USART2_TI           = 285U,     /* USART2_TI  */
    INT_SRC_USART2_TCI          = 286U,     /* USART2_TCI */
    INT_SRC_USART2_RTO          = 287U,     /* USART2_RTO */
    INT_SRC_USART3_EI           = 288U,     /* USART3_EI  */
    INT_SRC_USART3_RI           = 289U,     /* USART3_RI  */
    INT_SRC_USART3_TI           = 290U,     /* USART3_TI  */
    INT_SRC_USART3_TCI          = 291U,     /* USART3_TCI */
    INT_SRC_USART3_RTO          = 292U,     /* USART3_RTO */
    INT_SRC_USART4_EI           = 293U,     /* USART4_EI  */
    INT_SRC_USART4_RI           = 294U,     /* USART4_RI  */
    INT_SRC_USART4_TI           = 295U,     /* USART4_TI  */
    INT_SRC_USART4_TCI          = 296U,     /* USART4_TCI */
    INT_SRC_USART4_RTO          = 297U,     /* USART4_RTO */

    /* SPI */
    INT_SRC_SPI1_SPRI           = 299U,     /* SPI1_SPRI   */
    INT_SRC_SPI1_SPTI           = 300U,     /* SPI1_SPTI   */
    INT_SRC_SPI1_SPII           = 301U,     /* SPI1_SPII   */
    INT_SRC_SPI1_SPEI           = 302U,     /* SPI1_SPEI   */
    INT_SRC_SPI2_SPRI           = 304U,     /* SPI2_SPRI   */
    INT_SRC_SPI2_SPTI           = 305U,     /* SPI2_SPTI   */
    INT_SRC_SPI2_SPII           = 306U,     /* SPI2_SPII   */
    INT_SRC_SPI2_SPEI           = 307U,     /* SPI2_SPEI   */
    INT_SRC_SPI3_SPRI           = 309U,     /* SPI3_SPRI   */
    INT_SRC_SPI3_SPTI           = 310U,     /* SPI3_SPTI   */
    INT_SRC_SPI3_SPII           = 311U,     /* SPI3_SPII   */
    INT_SRC_SPI3_SPEI           = 312U,     /* SPI3_SPEI   */
    INT_SRC_SPI4_SPRI           = 314U,     /* SPI4_SPRI   */
    INT_SRC_SPI4_SPTI           = 315U,     /* SPI4_SPTI   */
    INT_SRC_SPI4_SPII           = 316U,     /* SPI4_SPII   */
    INT_SRC_SPI4_SPEI           = 317U,     /* SPI4_SPEI   */

    /* TIMER 4 */
    INT_SRC_TMR4_1_GCMP_UH      = 320U,     /* TMR41_GCMUH */
    INT_SRC_TMR4_1_GCMP_UL      = 321U,     /* TMR41_GCMUL */
    INT_SRC_TMR4_1_GCMP_VH      = 322U,     /* TMR41_GCMVH */
    INT_SRC_TMR4_1_GCMP_VL      = 323U,     /* TMR41_GCMVL */
    INT_SRC_TMR4_1_GCMP_WH      = 324U,     /* TMR41_GCMWH */
    INT_SRC_TMR4_1_GCMP_WL      = 325U,     /* TMR41_GCMWL */
    INT_SRC_TMR4_1_OVF          = 326U,     /* TMR41_GOVF  */
    INT_SRC_TMR4_1_UDF          = 327U,     /* TMR41_GUDF  */
    INT_SRC_TMR4_1_RELOAD_U     = 328U,     /* TMR41_RLOU  */
    INT_SRC_TMR4_1_RELOAD_V     = 329U,     /* TMR41_RLOV  */
    INT_SRC_TMR4_1_RELOAD_W     = 330U,     /* TMR41_RLOW  */
    INT_SRC_TMR4_2_GCMP_UH      = 336U,     /* TMR42_GCMUH */
    INT_SRC_TMR4_2_GCMP_UL      = 337U,     /* TMR42_GCMUL */
    INT_SRC_TMR4_2_GCMP_VH      = 338U,     /* TMR42_GCMVH */
    INT_SRC_TMR4_2_GCMP_VL      = 339U,     /* TMR42_GCMVL */
    INT_SRC_TMR4_2_GCMP_WH      = 340U,     /* TMR42_GCMWH */
    INT_SRC_TMR4_2_GCMP_WL      = 341U,     /* TMR42_GCMWL */
    INT_SRC_TMR4_2_OVF          = 342U,     /* TMR42_GOVF  */
    INT_SRC_TMR4_2_UDF          = 343U,     /* TMR42_GUDF  */
    INT_SRC_TMR4_2_RELOAD_U     = 344U,     /* TMR42_RLOU  */
    INT_SRC_TMR4_2_RELOAD_V     = 345U,     /* TMR42_RLOV  */
    INT_SRC_TMR4_2_RELOAD_W     = 346U,     /* TMR42_RLOW  */
    INT_SRC_TMR4_3_GCMP_UH      = 352U,     /* TMR43_GCMUH */
    INT_SRC_TMR4_3_GCMP_UL      = 353U,     /* TMR43_GCMUL */
    INT_SRC_TMR4_3_GCMP_VH      = 354U,     /* TMR43_GCMVH */
    INT_SRC_TMR4_3_GCMP_VL      = 355U,     /* TMR43_GCMVL */
    INT_SRC_TMR4_3_GCMP_WH      = 356U,     /* TMR43_GCMWH */
    INT_SRC_TMR4_3_GCMP_WL      = 357U,     /* TMR43_GCMWL */
    INT_SRC_TMR4_3_OVF          = 358U,     /* TMR43_GOVF  */
    INT_SRC_TMR4_3_UDF          = 359U,     /* TMR43_GUDF  */
    INT_SRC_TMR4_3_RELOAD_U     = 360U,     /* TMR43_RLOU  */
    INT_SRC_TMR4_3_RELOAD_V     = 361U,     /* TMR43_RLOV  */
    INT_SRC_TMR4_3_RELOAD_W     = 362U,     /* TMR43_RLOW  */

    /* EMB */
    INT_SRC_EMB_GR0             = 390U,     /* EMB_GR0  */
    INT_SRC_EMB_GR1             = 391U,     /* EMB_GR1  */
    INT_SRC_EMB_GR2             = 392U,     /* EMB_GR2  */
    INT_SRC_EMB_GR3             = 393U,     /* EMB_GR3  */

    /* EVENT PORT */
    INT_SRC_EVENT_PORT1         = 394U,     /* EVENT_PORT1  */
    INT_SRC_EVENT_PORT2         = 395U,     /* EVENT_PORT2  */
    INT_SRC_EVENT_PORT3         = 396U,     /* EVENT_PORT3  */
    INT_SRC_EVENT_PORT4         = 397U,     /* EVENT_PORT4  */

    /* I2S */
    INT_SRC_I2S1_TXIRQOUT       = 400U,     /* I2S1_TXIRQOUT */
    INT_SRC_I2S1_RXIRQOUT       = 401U,     /* I2S1_RXIRQOUT */
    INT_SRC_I2S1_ERRIRQOUT      = 402U,     /* I2S1_ERRIRQOUT */
    INT_SRC_I2S2_TXIRQOUT       = 403U,     /* I2S2_TXIRQOUT */
    INT_SRC_I2S2_RXIRQOUT       = 404U,     /* I2S2_RXIRQOUT */
    INT_SRC_I2S2_ERRIRQOUT      = 405U,     /* I2S2_ERRIRQOUT */
    INT_SRC_I2S3_TXIRQOUT       = 406U,     /* I2S3_TXIRQOUT */
    INT_SRC_I2S3_RXIRQOUT       = 407U,     /* I2S3_RXIRQOUT */
    INT_SRC_I2S3_ERRIRQOUT      = 408U,     /* I2S3_ERRIRQOUT */
    INT_SRC_I2S4_TXIRQOUT       = 409U,     /* I2S4_TXIRQOUT */
    INT_SRC_I2S4_RXIRQOUT       = 410U,     /* I2S4_RXIRQOUT */
    INT_SRC_I2S4_ERRIRQOUT      = 411U,     /* I2S4_ERRIRQOUT */

    /* COMPARATOR */
    INT_SRC_CMP1                = 416U,     /* ACMP1 */
    INT_SRC_CMP2                = 417U,     /* ACMP2 */
    INT_SRC_CMP3                = 418U,     /* ACMP3 */

    /* I2C */
    INT_SRC_I2C1_RXI            = 420U,     /* I2C1_RXI */
    INT_SRC_I2C1_TXI            = 421U,     /* I2C1_TXI */
    INT_SRC_I2C1_TEI            = 422U,     /* I2C1_TEI */
    INT_SRC_I2C1_EEI            = 423U,     /* I2C1_EEI */
    INT_SRC_I2C2_RXI            = 424U,     /* I2C2_RXI */
    INT_SRC_I2C2_TXI            = 425U,     /* I2C2_TXI */
    INT_SRC_I2C2_TEI            = 426U,     /* I2C2_TEI */
    INT_SRC_I2C2_EEI            = 427U,     /* I2C2_EEI */
    INT_SRC_I2C3_RXI            = 428U,     /* I2C3_RXI */
    INT_SRC_I2C3_TXI            = 429U,     /* I2C3_TXI */
    INT_SRC_I2C3_TEI            = 430U,     /* I2C3_TEI */
    INT_SRC_I2C3_EEI            = 431U,     /* I2C3_EEI */

    /* LVD */
    INT_SRC_LVD1                = 433U,     /* LVD1 */
    INT_SRC_LVD2                = 434U,     /* LVD2 */

    /* Temp. sensor */
    INT_SRC_OTS                 = 435U,     /* OTS */

    /* FCM */
    INT_SRC_FCMFERRI            = 436U,     /* FCMFERRI */
    INT_SRC_FCMMENDI            = 437U,     /* FCMMENDI */
    INT_SRC_FCMCOVFI            = 438U,     /* FCMCOVFI */

